Repository: 1601230/Taam-App
Catalog: Codi/Frontend Taam App/lib/l10n/app_*.arb
Languages: ca, es

# language
source: English
ca: Català
es: Español

# textBienvenida
source: Your trusted food selector
ca: El seu selector de menjar de confiança
es: Su selector de comida de confianza

# textBotonIniciar
source: START
ca: INICIAR
es: INICIAR

# textAboutUsRedirection
source: About Us
ca: Sobre nosaltres
es: Sobre nosotros

# titleConfig
source: Settings
ca: Configuració
es: Configuración

# titleIdiomaConfig
source: Language
ca: Llengua
es: Idioma

# titlePreferenciasConfig
source: Dietary preferences
ca: Preferències alimentàries
es: Preferencias alimentarias

# titleTemaAppConfig
source: App theme
ca: Tema de l'aplicació
es: Tema de la aplicación

# textSeleccionaPrefsConfig
source: Select your preferences
ca: Selecciona les teves preferències
es: Selecciona tus preferencias

# textSeleccionaPrefsDialog
source: Select your dietary preferences
ca: Selecciona les teves preferències alimentàries
es: Selecciona tus preferencias alimentarias

# textVegetarianoDialog
source: Vegetarian
ca: Vegetarià
es: Vegetariano

# textVeganoDialog
source: Vegan
ca: Vegà
es: Vegano

# textCeliacoDialog
source: Allergic to gluten
ca: Celíac
es: Celiaco

# textAlergicoLactosaDialog
source: Allergic to lactose
ca: Al·lèrgic a la lactosa
es: Alérgico a la lactosa

# textAlergicoFrutosSecoDialog
source: Allergic to nuts
ca: Al·lèrgic a la fruita seca
es: Alérgico a los frutos secos

# textAbstemio
source: Teetotal
ca: Abstemi
es: Abstemio

# textConfirmarDialog
source: Confirm
ca: Confirmar
es: Confirmar

# textCancelarDialog
source: Cancel
ca: Cancel·lar
es: Cancelar

# textClaro
source: Light
ca: Clar
es: Claro

# textOscuro
source: Dark
ca: Fosc
es: Oscuro

# textBuscadorProducto
source: Search for product/ingredient...
ca: Cercar producte/ingredient...
es: Buscar producto/ingrediente...

# textBuscadorCodigo
source: Enter barcode...
ca: Introduir codi de barres...
es: Introducir código de barras...

# titleRecomendaciones
source: Recommendations
ca: Recomanacions
es: Recomendaciones

# textInfoConsumicion
source: Consumption information
ca: Informació sobre la consumició
es: Información sobre la consumición

# titleFormProdIncorrecto
source: Product Form
ca: Formulari del Producte
es: Formulario del Producto

# titleIntroduceNombreForm
source: Enter the Product Name
ca: Introdueix el nom del Producte
es: Introduce el nombre del Producto

# labelTextNombreProd
source: Product Name
ca: Nom del producte
es: Nombre del producto

# titleProporcionaInfoForm
source: Provide the following images:
ca: Proporciona les següents imatges:
es: Proporciona las siguientes imagenes:

# labeltextImagenProd
source: Product Image
ca: Imatge del producte
es: Imagen del producto

# labeltextImagenCodigo
source: Barcode Image
ca: Imatge del codi de barres
es: Imagen del codigo de barras

# labeltextImagenIngredientes
source: Ingredients Image
ca: Imatge ingredients
es: Imagen ingredientes

# titleInfoAdicional
source: Additional Information:
ca: Informació addicional:
es: Información adicional:

# labeltextInfoAdicional
source: Additional Information
ca: Informació Addicional
es: Información Adicional

# textBotonEnviarForm
source: Send Form
ca: Enviar Formulari
es: Enviar Formulario

# titlePaginaReporteProducto
source: Report Food
ca: Pàgina de report
es: Pagina de reporte

# titleTipoReporteAlimento
source: Why do you want to report the food?
ca: Per què vols reportar l'aliment?
es: ¿Por qué quieres reportar el alimento?

# textSeleccionPreferenciasIncorrectas
source: Select the wrong preferences
ca: Selecciona les preferències incorrectes
es: Selecciona las preferencias incorrectas

# titleOtrosMotivos
source: Explain the reason for the report:
ca: Altres motius:
es: Otros motivos:

# textEscribeMotivos
source: Write the reasons
ca: Escriu els motius
es: Escribe los motivos

# textBotonEnviarReporte
source: Send report
ca: Enviar report
es: Enviar reporte

# titleSobreNosotros
source: About Us
ca: Sobre nosaltres
es: Sobre nosotros

# textNuestraEmpresa
source: Our company
ca: La nostra empresa
es: Nuestra empresa

# textObjetivo
source: Our objective is
ca: El nostre objectiu és
es: Nuestro objetivo es

# textInfoNuestraEmpresa
source: Welcome to Taam App! We are a group of committed students aiming to provide an application that facilitates users in verifying the foods they can consume based on their personal dietary restrictions or those imposed by their health condition. The name "Taam" comes from Arabic and means "Food." This name reflects our dedication to promoting proper and safe nutrition, offering our users a practical and helpful tool to make informed decisions about their diet and lifestyle. We recognize the importance of balanced eating and strive to ensure our users have access to relevant information they need. Taam App has been developed with passion and aligns with our commitment to offer a free and non-profit solution. We believe in equitable access to information and empowering individuals to make healthy and conscious choices. Our application provides an intuitive and user-friendly interface, where users can input their dietary restrictions and receive instant information about the suitability of foods for their consumption. Whether they follow a vegetarian diet, have allergies to specific ingredients, or have specific dietary restrictions, Taam App provides the peace of mind of knowing which foods are suitable for them. We take pride in offering a reliable and accurate experience. Our team works diligently to keep our food and restriction database up to date, ensuring the information we provide is reliable and of high quality. At Taam App, we care about the health and well-being of our users. We value the privacy and security of personal information and are committed to protecting it at all times. Join our community and discover how Taam App can make your life easier and help you make more informed dietary decisions! Together, we can build a path towards a healthier and balanced life.
ca: Benvinguts a Taam App! Som un grup d'estudiants compromesos a proporcionar una aplicació que faciliti als usuaris la verificació dels aliments que poden consumir segons les seves restriccions alimentàries personals o imposades pel seu estat de salut. El nom "Taam" prové de l'àrab i significa "Aliment". Aquest nom reflecteix la nostra dedicació a promoure una alimentació adequada i segura, oferint als nostres usuaris una eina pràctica i útil que els permeti prendre decisions informades sobre la seva dieta i estil de vida. Reconeixem la importància d'una alimentació equilibrada i volem assegurar-nos que els nostres usuaris tinguin accés a la informació rellevant que necessiten. Taam App ha estat desenvolupada amb passió i està en línia amb el nostre compromís d'oferir una solució gratuïta i sense ànim de lucre. Creiem en l'accés equitatiu a la informació i en potenciar les persones perquè prenguin decisions saludables i conscients. La nostra aplicació proporciona una interfície intuitiva i fàcil d'utilitzar, on els usuaris poden introduir les seves restriccions alimentàries i rebre informació instantània sobre l'adequació dels aliments per al seu consum. Sigui que segueixin una dieta vegetariana, siguin al·lèrgics a certs ingredients o tinguin restriccions dietètiques específiques, Taam App els ofereix la tranquil·litat de saber quins aliments els són adequats. Ens enorgulleix oferir una experiència fiable i precisa. El nostre equip treballa dur per mantenir actualitzada la nostra base de dades d'aliments i restriccions, assegurant-nos que la informació que proporcionem sigui fiable i de qualitat. A Taam App, ens preocupa la salut i el benestar dels nostres usuaris. Valorem la privacitat i la seguretat de la informació personal, i ens comprometem a protegir-la en tot moment. Uneix-te a la nostra comunitat i descobreix com Taam App pot facilitar-te la vida i ajudar-te a prendre decisions alimentàries més informades! Junts, podem construir un camí cap a una vida més saludable i equilibrada.
es: ¡Bienvenidos a Taam App! Somos un grupo de estudiantes comprometidos en proporcionar una aplicación que facilite a los usuarios la verificación de los alimentos que pueden consumir de acuerdo con sus restricciones alimenticias personales o impuestas por su estado de salud. El nombre "Taam" proviene del árabe y significa "Alimento". Este nombre refleja nuestra dedicación a promover una alimentación adecuada y segura, brindando a nuestros usuarios una herramienta práctica y útil que les permita tomar decisiones informadas sobre su dieta y estilo de vida. Reconocemos la importancia de una alimentación equilibrada y queremos asegurarnos de que nuestros usuarios tengan acceso a la información relevante que necesitan. Taam App ha sido desarrollada con pasión y está en línea con nuestro compromiso de ofrecer una solución gratuita y sin ánimo de lucro. Creemos en el acceso equitativo a la información y en empoderar a las personas para que tomen decisiones saludables y conscientes. Nuestra aplicación proporciona una interfaz intuitiva y fácil de usar, donde los usuarios pueden ingresar sus restricciones alimenticias y recibir información instantánea sobre la aptitud de los alimentos para su consumo. Ya sea que sigan una dieta vegetariana, sean alérgicos a ciertos ingredientes o tengan restricciones dietéticas específicas, Taam App les brinda la tranquilidad de saber qué alimentos son adecuados para ellos. Nos enorgullece ofrecer una experiencia confiable y precisa. Nuestro equipo trabaja arduamente para mantener actualizada nuestra base de datos de alimentos y restricciones, asegurándonos de que la información que brindamos sea confiable y de calidad. En Taam App, nos preocupamos por la salud y el bienestar de nuestros usuarios. Valoramos la privacidad y la seguridad de la información personal, y nos comprometemos a protegerla en todo momento. ¡Únete a nuestra comunidad y descubre cómo Taam App puede facilitar tu vida y ayudarte a tomar decisiones alimenticias más informadas! Juntos, podemos construir un camino hacia una vida más saludable y equilibrada

# titlePreguntasFrecuentes
source: Frequent questions
ca: Preguntes freqüents
es: Preguntas frecuentes

# textButtonEnviarDuda
source: Send another question
ca: Enviar altre pregunta
es: Enviar otra Pregunta

# titleEnviarPregunta
source: Send question
ca: Enviar pregunta
es: Enviar duda

# textEscribePregunta
source: Write your question
ca: Escriu la teva pregunta
es: Escribe tu pregunta

# textEscibeAqui
source: Write here
ca: Escriu aquí
es: Escribe aquí

# textApto
source: Suitable
ca: Apte
es: Apto

# textNoApto
source: Unsuitable
ca: No Apte
es: No Apto

# textDudoso
source: Doubtful
ca: Dubtós
es: Dudoso
